tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "zsh"
brew "stow"
brew "starship"
brew "fzf"
brew "neovim"
brew "htop"
brew "wget"
brew "nmap"
brew "bat"
brew "exa"
brew "git"
brew "node"
brew "python"
brew "tmux"
brew "sxhkd"
brew "pyenv"

cask "jetbrains-toolbox"
cask "font-jetbrains-mono-nerd-font"
brew "wireguard-tools"
