brew "zsh"
brew "stow"
brew "starship"
brew "fzf"
brew "neovim"
brew "htop"
brew "wget"
brew "nmap"
brew "bat"
brew "eza"
brew "git"
brew "node"
brew "python"
brew "tmux"
brew "pyenv"

cask "font-jetbrains-mono-nerd-font"
