tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"

# --- Shell & CLI ---
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"

# --- Hotkeys & Status Bar ---
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"

# --- Dev Tools ---
brew "docker"
brew "docker-compose"
brew "maven"
brew "nvm"          # Node Version Manager
brew "glfw"         # OpenGL dev library

# --- Networking & Utilities ---
brew "htop"
brew "wget"
brew "nmap"
brew "openvpn"

# --- Apps ---
cask "warp"
cask "firefox"
cask "postman"
cask "jetbrains-toolbox"
cask "wireguard"

# --- Fonts ---
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"

